
Network Working Group                                        W A Simpson
Internet Draft                                                Daydreamer
expires in six months                                       January 1995


            IPv6 Neighbor Discovery -- ICMP Message Formats
                draft-simpson-ipv6-discov-formats-02.txt



Status of this Memo

   This document is a submission to the IPng Working Group of the
   Internet Engineering Task Force (IETF).  Comments should be submitted
   to the ipng@sunroof.eng.sun.com mailing list.

   Distribution of this memo is unlimited.

   This document is an Internet-Draft.  Internet Drafts are working
   documents of the Internet Engineering Task Force (IETF), its Areas,
   and its Working Groups.  Note that other groups may also distribute
   working documents as Internet Drafts.

   Internet Drafts are draft documents valid for a maximum of six
   months, and may be updated, replaced, or obsoleted by other documents
   at any time.  It is not appropriate to use Internet Drafts as
   reference material, or to cite them other than as a ``working draft''
   or ``work in progress.''

   To learn the current status of any Internet-Draft, please check the
   ``1id-abstracts.txt'' listing contained in the internet-drafts Shadow
   Directories on:

      ftp.is.co.za (Africa)
      nic.nordu.net (Europe)
      ds.internic.net (US East Coast)
      ftp.isi.edu (US West Coast)
      munnari.oz.au (Pacific Rim)



Abstract

   This document specifies ICMP messages for identification of and
   forwarding to adjacent IPv6 nodes, including Mobility, Next Hop
   Determination and Router Discovery.





Simpson                  expires in six months                  [Page i]
DRAFT                    IPv6 Discovery Formats             January 1995


1.  Additional ICMP Packets

   The datagram format and basic facilities are already defined for ICMP
   as modified for IPv6 [IPv6-ICMP].

   Up-to-date values of the ICMP Type field are specified in the most
   recent "Assigned Numbers" [RFC-1700].  This document concerns the
   following values:

       33  Where-Are-You Solicitations
       34  I-Am-Here Advertisements








































Simpson                  expires in six months                  [Page 1]
DRAFT                    IPv6 Discovery Formats             January 1995


1.1.  Where-Are-You Solicitations

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |          Checksum             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                            Reserved                           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extensions ...
   +-+-+-+-+-+-+-+-+-+-+-+-


   Type              33

   Code             Up-to-date values are specified in the most recent
                    "Assigned Numbers" [RFC-1700].  Current values are
                    assigned as follows:

                      0     RESERVED
                      1     General
                      2     Router
                      3     Service (reserved)


   Checksum         The ICMP Checksum.

   Extensions       zero or more Extensions.  This field is variable in
                    length.  The Extensions SHOULD be included in the
                    order described.  These Extensions are described in
                    a later chapter.

   The contents of the Reserved field MUST be zero on transmission, and
   MUST be ignored on receipt.  Future backward-compatible changes to
   the protocol may specify the contents of the Reserved field or of
   additional octets at the end of the message.

















Simpson                  expires in six months                  [Page 2]
DRAFT                    IPv6 Discovery Formats             January 1995


1.1.1.  General Solicitation

   The General Solicitation MUST contain at least the following values:

   Link Header (if any):

      Destination      the link equivalent of the Solicited-Nodes IPv6
                       Multicast Address.  The mapping is described in
                       [IPv6-Address].

   IPv6 Header:

      Destination      the calculated Solicited-Nodes IPv6 Multicast
                       Address.  The scope is intra-link.

                       This is calculated by starting with the
                       exclusive-or of each byte of the target IPv6
                       Unicast Address, then adding the result to the
                       base Solicited-Nodes multicast (FF02::0700).

                       For example, to calculate the destination value
                       for target A::B:C, the exclusive-or is D.  The
                       calculated destination would be FF02::070D.

      Source           any IPv6 Unicast Address associated with the
                       sending interface.  It MUST NOT be the
                       Unspecified Address.

      Hop Limit        1

   ICMP fields:

      Code             1 for General Solicitation.

   Extensions:

      Known-Identifier  any IPv6 Unicast Address of the target.  The
                       Prefix Size and Metric are always zero.

      Maximum-Receive-Unit
                       for interfaces which do not have a fixed hardware
                       MTU.

      Media-Access     for interfaces which are not point-to-point
                       links.

      Node-Heard       for the target of the General Solicitation, if an
                       advertisement has been heard.



Simpson                  expires in six months                  [Page 3]
DRAFT                    IPv6 Discovery Formats             January 1995


                       In addition, each Router Advertisement that has
                       been heard, in order of preference.

      In the unlikely event that not all extensions fit in a single
      solicitation, as constrained by the MTU of the link, the remaining
      extensions are removed.

   The use of the General Solicitation is described in [D-Send].











































Simpson                  expires in six months                  [Page 4]
DRAFT                    IPv6 Discovery Formats             January 1995


1.1.2.  Router Solicitation

   The Router Solicitation MUST contain at least the following values:

   Link Header (if any):

      Destination      the link equivalent of the All-Routers IPv6
                       Multicast Address.  The mapping is described in
                       [IPv6-Address].

   IPv6 Header:

      Destination      the All-Routers IPv6 Multicast Address (FF02::3).
                       The scope is intra-link.

      Source           any IPv6 Unicast Address associated with the
                       sending interface.  It MAY be the Unspecified
                       Address, when the node has not yet determined an
                       IPv6 Unicast Address.

      Hop Limit        1

   ICMP fields:

      Code             2 for Router Solicitation.

   Extensions:

      Maximum-Receive-Unit
                       for interfaces which do not have a fixed hardware
                       MTU.

      Media-Access     for interfaces which are not point-to-point
                       links.

   The use of the Router Solicitation is described in [D-Send].















Simpson                  expires in six months                  [Page 5]
DRAFT                    IPv6 Discovery Formats             January 1995


1.2.  I-Am-Here Advertisements

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |          Checksum             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Sequence Number        |          LifeTime             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extensions ...
   +-+-+-+-+-+-+-+-+-+-+-+-


   Type              34

   Code             Up-to-date values are specified in the most recent
                    "Assigned Numbers" [RFC-1700].  Current values are
                    assigned as follows:

                      0     RESERVED
                      1     General
                      2     Router
                      3     Service (reserved)
                      4     Local Redirect
                      5     Remote Redirect


   Checksum         The ICMP Checksum.

   Sequence Number  the number of Advertisement messages sent since the
                    node was initialized.  The value MUST include this
                    advertisement.  That is, the first Advertisement
                    contains the value one, and the value zero indicates
                    that the number has rolled over.

   LifeTime         the time remaining before the advertised information
                    is considered expired, in hundredths of seconds.
                    The maximum time is approximately 10 minutes.

   Extensions       zero or more Extensions.  This field is variable in
                    length.  The Extensions SHOULD be included in the
                    order described.  These Extensions are described in
                    a later chapter.










Simpson                  expires in six months                  [Page 6]
DRAFT                    IPv6 Discovery Formats             January 1995


1.2.1.  General Advertisement

   The General Advertisement MUST contain at least the following values:

   IPv6 Header:

      Destination      the Source specified in the solicitation, when
                       the node is not serving several neighbors, and
                       the node is not operating as a Mobile Node.

                       Otherwise, the All-Nodes IPv6 Multicast Address
                       (FF02::1).  The scope is intra-link.  These
                       decisions are described in [D-Send].

      Source           the Identifier specified in the Known-Identifier
                       extension of the solicitation.

      Hop Limit        1

   ICMP fields:

      Code             1 for General Advertisement.

      Lifetime         the interface's configured AdvertisementLifetime.

   Extensions:

      Maximum-Receive-Unit
                       for interfaces which do not have a fixed hardware
                       MTU.

      Media-Access     for interfaces which are not point-to-point
                       links.

      Known-Identifier  for each of that node's known IPv6 Unicast
                       Addresses other than the IPv6 Unicast Address
                       specified in the IPv6 Source field.  The Prefix
                       Size and Metric are always zero.

                       This supports multiple addresses per interface,
                       as well as multi-homed nodes.  This enables the
                       recipient node to determine the best next-hop,
                       when the next-hop is on another interface
                       attached to the same advertising node.

      Node-Heard       for the sender of the General Solicitation.

                       In addition, each Router Advertisement that has



Simpson                  expires in six months                  [Page 7]
DRAFT                    IPv6 Discovery Formats             January 1995


                       been heard, in order of preference.

      In the unlikely event that not all extensions fit in a single
      advertisement, as constrained by the MTU of the link, the
      remaining extensions are removed.

   The use of the General Advertisement is described in [D-Send].












































Simpson                  expires in six months                  [Page 8]
DRAFT                    IPv6 Discovery Formats             January 1995


1.2.2.  Router Advertisement

   The Router Advertisement MUST contain at least the following values:

   IPv6 Header:

      Destination      the All-Nodes IPv6 Multicast Address (FF02::1).
                       The scope is intra-link.

      Source           the Primary Identifier of the router.

                       The same IPv6 Unicast Address is used for all
                       interfaces.  When a router has more than one
                       interface on the same link, or a multi-homed host
                       can hear the same router on more than one link,
                       it is necessary to unambiguously know which
                       router sent this advertisement.  The individual
                       routing-prefixes for the links are distinguished
                       in the Prefix-Information extension.

      Hop Limit        1

   ICMP fields:

      Code             2 for Router Advertisement.

      Lifetime         the interface's configured AdvertisementLifetime.

   Extensions:

      Hop-Limit        the current Internet Time-To-Live.

      Maximum-Receive-Unit
                       for interfaces which do not have a fixed hardware
                       MTU.

      Media-Access     for interfaces which are not point-to-point
                       links.

      Mobility-Support  for interfaces which support Mobile
                       Registration, either as a Foreign Agent or Home
                       Agent [Mobility].

                       In the absence of this extension, all routers are
                       expected to support decapsulation and forwarding
                       from an interface, without explicit registration
                       by a Mobile Node.




Simpson                  expires in six months                  [Page 9]
DRAFT                    IPv6 Discovery Formats             January 1995


      Change-Identifier
                       for each of that interface's IPv6 Unicast or
                       Cluster Addresses which has changed from a value
                       previously advertised with the Prefix-Information
                       or Known-Identifier extensions.  Included at
                       least once, and repeated until the original
                       LifeTime expires.

      Prefix-Information
                       for each of that interface's associated IPv6
                       Unicast or Cluster Addresses whose Advertise
                       flags are TRUE.

      Known-Identifier  for each of that node's other IPv6 Unicast or
                       Cluster Addresses which have not already been
                       included through routing-prefix subsumption.
                       This may be another address for the same
                       interface, or may identify another interface on
                       the same node, or may proxy for another node.

                       When a number of interfaces, such as point-to-
                       point interfaces, may be aggregated with the same
                       routing-prefix, only one extension need be
                       included.

      Node-Heard       for each Router Advertisement that has been
                       heard, in order of preference.

      In the unlikely event that not all extensions fit in a single
      advertisement, as constrained by the MTU of the link, multiple
      advertisements are sent, with each containing as many remaining
      extensions as can fit.

   The use of the Router Advertisement is described in [D-Send].

















Simpson                  expires in six months                 [Page 10]
DRAFT                    IPv6 Discovery Formats             January 1995


1.2.3.  Local Redirect

   The Local Redirect MUST contain at least the following values:

   IPv6 Header:

      Destination      the Source specified in the datagram being
                       redirected.

      Source           the Primary Identifier of the router.

      Hop Limit        1

      Flow Label       When the redirect applies to a single flow, this
                       is set to a non-zero value.

                       Note that this value is relative to the
                       Destination specified in the datagram being
                       redirected.

   ICMP fields:

      Code             4 for Local Redirect.

      Sequence         the last Sequence from the target node
                       Advertisement.

      Lifetime         the remaining Lifetime from the target node
                       Advertisement.

   Extensions:

      Maximum-Receive-Unit
                       for interfaces which do not have a fixed hardware
                       MTU, the Maximum-Receive-Unit extension from the
                       target node Advertisement.

      Media-Access     for interfaces which are not point-to-point
                       links, the Media-Access extension from the target
                       node Advertisement.

      Known-Identifier  for each IPv6 Unicast or Cluster Address
                       associated with the changed node(s).  The Metric
                       is always zero.

                       When the redirect applies to an entire routing-
                       prefix, the Prefix Size is set to the size of the
                       routing-prefix.  This enables the recipient node



Simpson                  expires in six months                 [Page 11]
DRAFT                    IPv6 Discovery Formats             January 1995


                       to determine the best next-hop without multiple
                       redirects for each routing-prefix.

      Redirected-Header
                       The target header.

      In the unlikely event that not all extensions fit in a single
      redirect, as constrained by the MTU of the link, the remaining
      extensions are removed.  Only a single redirect is sent.

   The use of the Local Redirect is described in [D-Send].








































Simpson                  expires in six months                 [Page 12]
DRAFT                    IPv6 Discovery Formats             January 1995


1.2.4.  Remote Redirect

   The Remote Redirect MUST contain at least the following values:

   IPv6 Header:

      Destination      the Source specified in the packet being
                       redirected.

      Source           the Destination specified in the packet being
                       redirected.

      Hop Limit        from the Router Advertisement.

   An Authentication Header is required.

   ICMP fields:

      Code             5 for Remote Redirect.

      Sequence         the last Sequence from the target node
                       Advertisement.

      Lifetime         the remaining Lifetime from the target node
                       Advertisement.

   Extensions:

      Known-Identifier  the IPv6 Unicast or Cluster Address which is
                       used as a Care-Of-Address to reach the Source.

      Redirected-Header
                       The target header.

      In the unlikely event that not all extensions fit in a single
      redirect, as constrained by the MTU of the link, the remaining
      extensions are removed.  Only a single redirect is sent.

   The use of the Remote Redirect is described in [D-Send].












Simpson                  expires in six months                 [Page 13]
DRAFT                    IPv6 Discovery Formats             January 1995


2.  Extensions

   Extensions allow variable amounts of information to be carried within
   each Solicitation or Advertisement packet.  Some extensions are
   common to both packet types.

   The end of the list of Extensions is indicated by the Payload Length
   of the IPv6 packet.

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |   Extension   |    Length     |    Data ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Extension        This document concerns the following values:

                      0     Single Pad (no length field)
                      1     Multiple Pads (with length field)
                      2     Change-Identifier
                      3     Known-Identifier
                      4     Node-Heard
                      5     Prefix-Information
                     13     Hop-Limit
                     14     Maximum-Receive-Unit
                     15     Media-Access
                     16     Mobility-Support
                    254     Redirected-Header

                    Up-to-date values are specified in the most recent
                    "Assigned Numbers" [RFC-1700].

   Length           the length of the Data field.  The Length does not
                    include the Extension and Length octets.

                    The Single Pad (extension 0) is a special case,
                    which has neither Length field nor Data field.

   Data             zero or more octets.  The format and length of the
                    Data field is determined by the Extension and Length
                    fields.

   When an extension is encountered which is not recognized, it is
   ignored.  The Length field is used to skip the data field in
   searching for the next extension.

   Every extension is aligned such that internal fields fall on natural
   boundaries, except that fields larger than 64-bits need only be
   aligned to 64-bit boundaries.



Simpson                  expires in six months                 [Page 14]
DRAFT                    IPv6 Discovery Formats             January 1995


   Any unused portion of the datagram between such Extensions is padded
   as appropriate.  The final Extension in a datagram does not require
   trailing padding.



2.1.  Single Pad

   +-+-+-+-+-+-+-+-+
   |   Extension   |
   +-+-+-+-+-+-+-+-+


   Extension        0



2.2.  Multiple Pads

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |   Extension   |    Length     |   Data ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Extension        1

   Length           the length of the Data field.

   Data             zero or more bytes of zeroes.






















Simpson                  expires in six months                 [Page 15]
DRAFT                    IPv6 Discovery Formats             January 1995


2.3.  Change-Identifier

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        0        | Prefix Size |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           Identifier                          ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        2

   Length           34

   Prefix Size      the number of bits in the Identifier which define
                    the routing-prefix width for the link.  The value
                    ranges from 0 to 127.

                    If the Identifier does not indicate a valid prefix,
                    the value is zero.

   Identifier       an IPv6 Unicast or Cluster Address.

   For usage, see the specific message description, and [D-Send].


























Simpson                  expires in six months                 [Page 16]
DRAFT                    IPv6 Discovery Formats             January 1995


2.4.  Known-Identifier

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        0        | Prefix Size |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                             Metric                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           Identifier                          ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        3

   Length           22

   Prefix Size      the number of bits in the Identifier which define
                    the routing-prefix width for the link.  The value
                    ranges from 0 to 127.

                    If the Identifier does not indicate a valid prefix,
                    the value is zero.

   Metric           the preference level for use of this node to forward
                    packets to the Identifier.  Lower values indicate
                    greater preference.

   Identifier       an IPv6 Unicast or Cluster Address.

   For usage, see the specific message description, and [D-Send].




















Simpson                  expires in six months                 [Page 17]
DRAFT                    IPv6 Discovery Formats             January 1995


2.5.  Node-Heard

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |        0        | Prefix Size |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |        Sequence Number        |      Remaining LifeTime       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                       Primary Identifier                      ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |              MRU              |       0       |     Speed     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                            Quality                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                      Advertisement Count                      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                          Error Count                          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        4

   Length           38

   Prefix Size      the number of bits in the Primary Identifier which
                    define the routing-prefix width for the link.  The
                    value ranges from 0 to 127.

                    If the Primary Identifier does not indicate a valid
                    prefix, the value is zero.

   Sequence Number  the last heard sequence number from the node.

   Remaining LifeTime
                    the time remaining before the entry is considered
                    expired.  Calculated from the LifeTime field of the
                    Advertisement heard.

   Primary Identifier
                    the primary IPv6 Unicast Address for the node, taken
                    from the Source field of the Advertisement heard.

   MRU              the maximum size packet that the node will receive
                    over the link.

   Speed            the speed of the link over which the advertisement
                    or solicitation was heard.  Higher values indicate



Simpson                  expires in six months                 [Page 18]
DRAFT                    IPv6 Discovery Formats             January 1995


                    greater speed.  The speed value (in bits per second)
                    is related to:

                                    int( 10 * ln( speed / 100 ) )

                      0      link is down
                      1 - 9  reserved
                     10      300 or less
                     24    1,200     96      1,544,000 T1
                     31    2,400     99      2,048,000 E1
                     38    4,800    106      4,000,000 Token Ring
                     42    7,200    110      6,312,000 T2
                     45    9,600    115     10,000,000 Ethernet
                     49   14,400    119     16,000,000 Token Ring
                     52   19,200
                     56   28,800    130     44,736,000 T3
                     59   38,400    142    155,520,000 STS-3,STM-1
                     63   57,600    202    622,080,000 STS-12,STM-4
                     64   64,000    216  2,488,320,000 STS-48,STM-16
                     71  128,000
                     73  153,600
                     78  256,000


   Quality          an indication of the signal quality received from
                    this node.  Higher values indicate greater quality.

                    If the Quality is not used, the value is zero.

   Advertisement Count
                    the number of advertisements that have been heard
                    from the identified node.

   Error Count      the number of errors which have been detected on the
                    link with the identified node.

   This extension is included in an Advertisement message to indicate a
   node which has been heard.

   The MRU, Speed, Quality, Advertisement Count, and Error Count are
   primarily used for selecting among multiple paths in a wireless
   environment.









Simpson                  expires in six months                 [Page 19]
DRAFT                    IPv6 Discovery Formats             January 1995


2.6.  Prefix-Information

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |C|R|      0      | Prefix Size |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                       0                       |  Preference   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   ~                           Identifier                          ~
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        5

   Length           18

   C                Contiguous.  When this bit is set to 1, the
                    routing-prefix is entirely confined to the link.
                    When forwarding, a node MAY use the routing-prefix
                    to determine whether a target node is on the link.

   R                Registration.  When this bit is set to 1, a node
                    MUST use [DHCPng] to self-configure its addresses.

   Prefix Size      the number of bits in the Identifier which define
                    the routing-prefix width for the link.  The value
                    ranges from 0 to 127.

                    If the Identifier does not indicate a valid prefix,
                    the value is zero.

   Preference       the preference level for use of this node to forward
                    packets having a Source longest match with the
                    Identifier.  Higher values indicate greater
                    preference.

   Identifier       one of the IPv6 Unicast or Cluster Addresses for
                    this interface.

   This extension is found in Router Advertisements.










Simpson                  expires in six months                 [Page 20]
DRAFT                    IPv6 Discovery Formats             January 1995


2.7.  Hop-Limit

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |     Hops      |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        13

   Length           1

   Hops             the currently recommended IPv6 Hop Limit.

                    Up-to-date values are specified in the most recent
                    "Assigned Numbers" [RFC-1700].




































Simpson                  expires in six months                 [Page 21]
DRAFT                    IPv6 Discovery Formats             January 1995


2.8.  Maximum-Receive-Unit

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |             MRU               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        14

   Length           2

   MRU              the maximum size packet that the node will receive
                    over the link.

   This extension MUST be included in those messages sent from an
   interface for which there is no dependable MTU, such as Frame-Relay
   or Asynchronous Transfer Mode.


































Simpson                  expires in six months                 [Page 22]
DRAFT                    IPv6 Discovery Formats             January 1995


2.9.  Media-Access

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |            Family             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Media Address ...
   +-+-+-+-+-+-+-+-+-+-+-+-


   Extension        15

   Length           >= 2

   Family           the Address Family Number.

                    Up-to-date values are specified in the most recent
                    "Assigned Numbers" [RFC-1700].

   Media Address    the media address which is used to access this node.
                    This field is variable in length.

                    The Media Address is always specified in Canonical
                    order.

   This extension MUST be included in those messages sent from an
   interface on a multi-access media.

   It MUST NOT be included in a message sent from a point-to-point
   interface, or in messages such as the Remote Redirect which pass
   through intermediate nodes.





















Simpson                  expires in six months                 [Page 23]
DRAFT                    IPv6 Discovery Formats             January 1995


2.10.  Mobility-Support


   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Extension   |    Length     |F|  Reserved   |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Extension        16

   Length           >= 1

   F                Foreign Agent bit.  When this bit is set to 1,
                    Mobile Registration through the Foreign Agent is
                    required, even when the Mobile Node has acquired a
                    transient Care-Of-Address.

   Reserved         Sent as zero; ignored on reception.

   This extension is found in Router Advertisements.































Simpson                  expires in six months                 [Page 24]
DRAFT                    IPv6 Discovery Formats             January 1995


2.11.  Redirected-Header

                                   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
                                   |   Extension   |    Length     |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   IPv6 Header(s) ...
   +-+-+-+-+-+-+-+-+-+-+-+-


   Extension        254

   Length           >= 64

   IPv6 Header(s)   variable length, 64-bit aligned.

   This extension is included in the Local or Remote Redirect to verify
   the traffic that is being redirected.


































Simpson                  expires in six months                 [Page 25]
DRAFT                    IPv6 Discovery Formats             January 1995


Security Considerations

   Whenever Ran gets them done.



References

   [D-Send]

   [DHCPng]

   [IPv6-Address]

   [IPv6-ICMP]

   [Mobility]

   [RFC-1700]



Acknowledgements

   Many thanks to Fred Goldstein, K1IO (DEC, BBN) for his pioneering
   work on Radio Shortest Path First (RSPF) for Amateur Packet Radio.

   Thanks also for suggestions and contributions from the Simple-IP
   Working Group.

   Special thanks for implementation review by Alex Conta (DEC), Chuck
   Desostoa (), Dan McDonald (Naval Research Laboratory), Fred Rabouw
   (Network Systems Netherlands), and Brad Stone (Hewlett-Packard).



Author's Address

   Questions about this memo can also be directed to:

      William Allen Simpson
      Daydreamer
      Computer Systems Consulting Services
      1384 Fontaine
      Madison Heights, Michigan  48071

      Bill.Simpson@um.cc.umich.edu
          bsimpson@MorningStar.com



Simpson                  expires in six months                 [Page 26]
DRAFT                    IPv6 Discovery Formats             January 1995





















































Simpson                  expires in six months                 [Page 27]
DRAFT                    IPv6 Discovery Formats             January 1995


                           Table of Contents


     1.     Additional ICMP Packets ...............................    1
        1.1       Where-Are-You Solicitations .....................    2
           1.1.1  General Solicitation ............................    3
           1.1.2  Router Solicitation .............................    5
        1.2       I-Am-Here Advertisements ........................    6
           1.2.1  General Advertisement ...........................    7
           1.2.2  Router Advertisement ............................    9
           1.2.3  Local Redirect ..................................   11
           1.2.4  Remote Redirect .................................   13

     2.     Extensions ............................................   14
        2.1       Single Pad ......................................   15
        2.2       Multiple Pads ...................................   15
        2.3       Change-Identifier ...............................   16
        2.4       Known-Identifier ................................   17
        2.5       Node-Heard ......................................   18
        2.6       Prefix-Information ..............................   20
        2.7       Hop-Limit .......................................   21
        2.8       Maximum-Receive-Unit ............................   22
        2.9       Media-Access ....................................   23
        2.10      Mobility-Support ................................   24
        2.11      Redirected-Header ...............................   25

     SECURITY CONSIDERATIONS ......................................   26

     REFERENCES ...................................................   26

     ACKNOWLEDGEMENTS .............................................   26

     AUTHOR'S ADDRESS .............................................   26


